console.log('-----------Доп 1------------');
// . Три різних числа вводяться через prompt().
// За допомоги if else вивести іх в порядку зростання. (відсортувати по зростанню)
let a111 = +prompt('enter a');
let b111 = +prompt('enter b');
let c111 = +prompt('enter c');
let min;
let middle;
let max;
if (a111 == b111 || a111 == c111 || b111 == c111) {
    alert('введіть різні значення');
} else if (a111 > b111 && a111 > c111) {
    max = a111;
    if (b111 > c111) {
        middle = b111;
        min = c111;
    } else {
        middle = c111;
        min = b111;
    }
    console.log(min + ' ' + middle + ' ' + max);
} else if (b111 > a111 && b111 > c111) {
    max = b111;
    if (a111 > c111) {
        middle = a111;
        min = c111;
    } else {
        middle = c111;
        min = a111;
    }
    console.log(min + ' ' + middle + ' ' + max);
} else if (c111 > b111 && c111 > a111) {
    max = c111;
    if (a111 > b111) {
        middle = a111;
        min = b111;
    } else {
        middle = b111;
        min = a111;
    }
    console.log(min + ' ' + middle + ' ' + max);
} else {
    alert('щось не так!!! вводьте лише числові  значення');
}


console.log('-----------Доп 2------------');
// Все параматры получаем с клавиатуры!!!!
// Имитируем поведение пешехода на перекстке.
// Если светофор зеленый - вывести "иди".
// Если светофор желтый - вывести "подожди".
// Если светофор красный - вывести "стой".
// Если светофор в аварийном режиме вывести "делай что хочешь"!
let color = prompt('який колір світлофора ви бачите');
if (color === 'green' || color === 'зелений') {
    alert('можете йти');
} else if (color === 'yellow' || color === 'жовтий') {
    alert('потрібно зачекати');
} else if (color === 'red' || color === 'червоний') {
    alert('стій');
} else if (color === "") {
    alert('введіть колір');
    // } else if (color==Number){
    //     alert('вводьте лише слова');
} else {
    alert('роби що хочеш');
}

console.log('-----------Доп 3------------');
// Все параметры получаем с клавиатуры!!!!(prompt , confirm)
// Создать переменную isRoadClear которая характеризирует наличие на дороге машин.
// Улучшаем предыдущее задание.
// Если светофор зеленый и машин нет - вывести "иди".
// Если светофор зеленый и машины есть  - вывести подожди пока нарушители проедут".
// Если светофор желтый и машины есть - вывести "жди".
// Если светофор желтый и машин нет - вывести "все рано жди".
// Если светофор красный и машин нет- вывести "стой все рано".
// Если светофор красный - и машины есть вывести "стой и жди".
// Если светофор в аварийном режиме вывести "делай что хочешь"!
let collor = prompt('введіть колір сфітлофора');
let isRoadClear = confirm('машини рухаються?');
if (collor === 'green' || collor === 'зелений') {
    if (isRoadClear === true) {
        alert('зачекай, хай проїдуть');
    } else {
        alert('можна йти');
    }
} else if (collor === 'yellow' || collor === 'жовтий') {
    if (isRoadClear === true) {
        alert('зачекай');
    } else {
        alert('всерівно чекай');
    }
}
    else if (collor === 'red' || collor === 'червоний') {
        if (isRoadClear === true) {
            alert('стій і чекай');
        } else {
            alert('всерівно стій');
        }
    }
else {
            alert('роби що хочеш')
        }        